# DataFrame 복사, 인덱싱, 정렬, groupby

In [2]:
import pandas as pd

In [4]:
# dataframe 로딩

In [6]:
df = pd.read_csv("datas/korea-star.csv")
df.head(3)

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501

## 1. 대입과 복사

In [10]:
new_df = df

In [13]:
new_df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615

In [15]:
new_df['이름'] = 0
new_df.head(3)

   이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0   0   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1   0   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2   0  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501

In [17]:
df.head(3)

   이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0   0   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1   0   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2   0  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501

In [20]:
# 같은 메모리 주소를 참조하기 때문에 new_df의 수정값이 df에도 적용됨
# 컨테이너 자료형은 파괴형 자료형
print(hex(id(new_df)))
print(hex(id(df)))

0x2a0f18ded00
0x2a0f18ded00

In [28]:
# 원본 데이터는 그대로 두고, 새로운 변수에 복제하려면
# .copy()
# 데이터 프레임 복사 .=. 깊은 복사
df = pd.read_csv("datas/korea-star.csv")
df.head(3)

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501

In [35]:
# !!!!!!!!!!!!!!!!!!!!
df_copy = df.copy()

In [29]:
print(hex(id(df)))
print(hex(id(df_copy)))

0x2a0fa0e8790
0x2a0fa0af700

In [32]:
df_copy['인기지수'] = 0
df_copy.head(3)

    이름     그룹   소속사  성별        생년월일      키 혈액형  인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A     0
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B     0
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB     0

In [36]:
df.head(3)

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501

In [ ]:
# df_copy 삭제하려면
del df_copy

In [40]:
# 메모리에서 객체를 지워버리므로 식별 불가능
df_copy

NameError: name 'df_copy' is not defined

## 2. row, column 추가 및 삭제

### 2-1. row의 추가

In [48]:
# 데이터 확인
df

      이름     그룹      소속사  성별        생년월일      키 혈액형      인기지수
0    아이린   레드벨벳       SM  여자  1991-03-29  160.0   A   8256324
1    차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
2      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
3     민현    NaN     플레디스  남자  1995-08-09  182.3   O   4989792
4     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
5      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
6     윤아   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
7     백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
8     JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
9     슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   4925442
10  강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
11    정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   7208335
12    화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
13   하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
14    슬기   레드벨벳       SM  여자  1994-02-10  161.0   A   5021452
15    지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260

In [49]:
# 데이터프레임의 행 데이터의 개수
len(df)

16

In [50]:
# 추가할 데이터
add_data = {'이름':'바니', '그룹':'바니그룹', '소속사':'안테나', 
           '성별':'여자', '생년월일':'1990-01-01', '키':195.0, 
           '혈액형':'O', '인기지수':7235678}
add_data

{'이름': '바니',
 '그룹': '바니그룹',
 '소속사': '안테나',
 '성별': '여자',
 '생년월일': '1990-01-01',
 '키': 195.0,
 '혈액형': 'O',
 '인기지수': 7235678}

In [51]:
df.loc[len(df)] = add_data  # []는 인덱싱 기법

In [52]:
df.tail(3)

    이름     그룹  소속사  성별        생년월일      키 혈액형      인기지수
14  슬기   레드벨벳   SM  여자  1994-02-10  161.0   A   5021452
15  지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
16  바니   바니그룹  안테나  여자  1990-01-01  195.0   O   7235678

In [53]:
df.loc[len(df)] = add_data

In [55]:
df.tail(3)

    이름     그룹  소속사  성별        생년월일      키 혈액형      인기지수
15  지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
16  바니   바니그룹  안테나  여자  1990-01-01  195.0   O   7235678
17  바니   바니그룹  안테나  여자  1990-01-01  195.0   O   7235678

In [57]:
# 추가할 데이터 2
add_data2 = {'이름':'아이유', '소속사':'이담엔터테인먼트', 
           '성별':'여자', '생년월일':'1990-01-01', '키':160.0, 
           '혈액형':'A', '인기지수':10235678}
add_data2

{'이름': '아이유',
 '소속사': '이담엔터테인먼트',
 '성별': '여자',
 '생년월일': '1990-01-01',
 '키': 160.0,
 '혈액형': 'A',
 '인기지수': 10235678}

In [60]:
df.loc[len(df)] = add_data2
df.tail(3)

     이름   그룹       소속사  성별        생년월일      키 혈액형      인기지수
18  아이유  NaN  이담엔터테인먼트  여자  1990-01-01  160.0   A  10235678
19  아이유  NaN  이담엔터테인먼트  여자  1990-01-01  160.0   A  10235678
20  아이유  NaN  이담엔터테인먼트  여자  1990-01-01  160.0   A  10235678

In [62]:
# 원하는 행 삭제
df.drop([17, 19, 20])
df.tail(5)

     이름    그룹       소속사  성별        생년월일      키 혈액형      인기지수
16   바니  바니그룹       안테나  여자  1990-01-01  195.0   O   7235678
17   바니  바니그룹       안테나  여자  1990-01-01  195.0   O   7235678
18  아이유   NaN  이담엔터테인먼트  여자  1990-01-01  160.0   A  10235678
19  아이유   NaN  이담엔터테인먼트  여자  1990-01-01  160.0   A  10235678
20  아이유   NaN  이담엔터테인먼트  여자  1990-01-01  160.0   A  10235678

In [ ]:
# 삭제하고 df 다시 대입해야 적용됨
df = df.drop([17, 19, 20])

In [67]:
# index는 변화 없음
df.tail(5)

     이름     그룹       소속사  성별        생년월일      키 혈액형      인기지수
13  하성운     핫샷   스타크루이엔티  남자  1994-03-22  167.1   A   4036489
14   슬기   레드벨벳        SM  여자  1994-02-10  161.0   A   5021452
15   지민  방탄소년단       빅히트  남자  1995-10-13  173.6   A  10523260
16   바니   바니그룹       안테나  여자  1990-01-01  195.0   O   7235678
18  아이유    NaN  이담엔터테인먼트  여자  1990-01-01  160.0   A  10235678

In [68]:
# 위와 같은 식
df.drop([18], inplace=True)
df.tail(5)

     이름     그룹      소속사  성별        생년월일      키 혈액형      인기지수
12   화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
13  하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
14   슬기   레드벨벳       SM  여자  1994-02-10  161.0   A   5021452
15   지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260
16   바니   바니그룹      안테나  여자  1990-01-01  195.0   O   7235678

### 2-2. column 추가

In [71]:
df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615

In [73]:
df['국적'] = '대한민국'

In [75]:
df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수    국적
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324  대한민국
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027  대한민국
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501  대한민국
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792  대한민국
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615  대한민국

In [77]:
# 컬럼 전체에 동일한 값이 적용됨
# 만약, 값을 변경하고 싶다면, loc 함수를 활용해서 변경할 수 있음

In [78]:
df.loc[ df['이름'] == '차은우', '국적' ] = 'korea'

In [80]:
df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수     국적
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324   대한민국
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027  korea
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501   대한민국
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792   대한민국
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615   대한민국

## 3. 통계값 다루기

In [88]:
# 최소값
df['키'].min()

160.0

In [89]:
# 최대값
df['키'].max()

195.0

In [90]:
# 함계
df['키'].sum()

2624.3

In [92]:
# 평균
df['키'].mean()

174.95333333333335

### 분산, 표준편차
- 분산과 표준편차는 데이터가 평균으로부터 얼마나 떨어져 있는지 정도를 나타냄
- 분산은 (데이터 - 평균) 2 을 모두 합한 값** / n
- 표준편차는 분산의 루트

In [96]:
# 분산
df['키'].var()

87.9769523809524

In [97]:
# 표준편차
df['키'].std()

9.379602996979797

In [98]:
# 위의 과정

In [100]:
# 개수
df['키'].count()

15

In [103]:
# 중앙값
df['키'].median()

176.0

In [105]:
# 최빈값
df['키'].mode()

0    178.0
Name: 키, dtype: float64

In [108]:
# 만약 서로 다른 값 여러개가 최빈값으로 나왔을 경우 타입 확인(시리즈면 1차원 벡터) 후 인덱싱으로 구분
type(df['키'].mode())
df['키'].mode()[0]
# 하나의 컬럼 series => 1차원 리스트 => 벡터 (1차원 결과의 인덱싱은 위와 같이 함)

178.0

In [110]:
# 최빈값의 data set(row) 확인
df.loc[df['키']==178, :]

    이름     그룹  소속사  성별        생년월일      키 혈액형     인기지수    국적
2    뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB  8073501  대한민국
11  정국  방탄소년단  빅히트  남자  1997-09-01  178.0   A  7208335  대한민국

In [ ]:
# 민현의 키를 176으로 변경
df.loc[ df['이름'] == '민현', '키'] = 176

## 4. GroupBy 그룹으로 묶어보기

In [113]:
df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수     국적
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324   대한민국
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027  korea
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501   대한민국
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792   대한민국
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615   대한민국

In [114]:
df.value_counts('소속사')

소속사
빅히트        5
SM         3
플레디스       3
RBW        1
스타크루이엔티    1
안테나        1
커넥트        1
큐브         1
판타지오       1
Name: count, dtype: int64

In [118]:
# 데이터를 보려면 원하는 집계함수에 해당하는 메서드를 뒤에 붙여줘야 함
# count() - 갯수
# sum() - 합계
# mean() - 평균
# var() - 분산
# std() - 표준편차
# min()/max() - 최소값, 최대값
df.groupby('소속사')

In [120]:
df.groupby('소속사').count()

         이름  그룹  성별  생년월일  키  혈액형  인기지수  국적
소속사
RBW       1   1   1     1  1    1     1   1
SM        3   3   3     3  2    3     3   3
빅히트       5   5   5     5  5    5     5   5
스타크루이엔티   1   1   1     1  1    1     1   1
안테나       1   1   1     1  1    1     1   1
커넥트       1   0   1     1  1    1     1   1
큐브        1   1   1     1  0    1     1   1
판타지오      1   1   1     1  1    1     1   1
플레디스      3   2   3     3  3    3     3   3

In [122]:
df.groupby('소속사').sum()

,이름,그룹,성별,생년월일,키,혈액형,인기지수,국적
소속사,,,,,,,,
RBW,화사,마마무,여자,1995-07-23,162.1,A,7650928,대한민국
SM,아이린윤아슬기,레드벨벳소녀시대레드벨벳,여자여자여자,1991-03-291989-03-091994-02-10,321.0,AAA,17196437,대한민국대한민국대한민국
빅히트,뷔진슈가정국지민,방탄소년단방탄소년단방탄소년단방탄소년단방탄소년단,남자남자남자남자남자,1995-12-301992-12-041993-03-091997-09-011995-1...,882.8,ABOOAA,35300846,대한민국대한민국대한민국대한민국대한민국
스타크루이엔티,하성운,핫샷,남자,1994-03-22,167.1,A,4036489,대한민국
안테나,바니,바니그룹,여자,1990-01-01,195.0,O,7235678,대한민국
커넥트,강다니엘,0,남자,1996-12-10,180.0,A,8273745,대한민국
큐브,소연,아이들,여자,1998-08-26,0.0,B,4668615,대한민국
판타지오,차은우,아스트로,남자,1997-03-30,183.0,B,3506027,korea
플레디스,민현백호JR,뉴이스트뉴이스트,남자남자남자,1995-08-091995-07-211995-06-08,533.3,OABO,11565583,대한민국대한민국대한민국

In [124]:
df.groupby('성별').sum()

,이름,그룹,소속사,생년월일,키,혈액형,인기지수,국적
성별,,,,,,,,
남자,차은우뷔민현진백호JR슈가강다니엘정국하성운지민,아스트로방탄소년단방탄소년단뉴이스트뉴이스트방탄소년단방탄소년단핫샷방탄소년단,판타지오빅히트플레디스빅히트플레디스플레디스빅히트커넥트빅히트스타크루이엔티빅히트,1997-03-301995-12-301995-08-091992-12-041995-0...,1946.2,BABOOABOOAAAA,62682690,korea대한민국대한민국대한민국대한민국대한민국대한민국대한민국대한민국대한민국대한민국
여자,아이린소연윤아화사슬기바니,레드벨벳아이들소녀시대마마무레드벨벳바니그룹,SM큐브SMRBWSM안테나,1991-03-291998-08-261989-03-091995-07-231994-0...,678.1,ABAAAO,36751658,대한민국대한민국대한민국대한민국대한민국대한민국

In [130]:
# 특정 열만 출력?
# 혈액형으로 그룹바이 해서 키와 인기지수만 평균내서 보기
df.groupby('혈액형')[['키','인기지수']].mean()

              키        인기지수
혈액형
A    168.828571  6861149.25
AB   176.500000  5687577.50
B    183.000000  4087321.00
O    181.300000  4999071.40

In [131]:
# 하나의 컬럼일 경우 []하나만
# 시리즈로 자료구조 바뀜
df.groupby('혈액형')['키'].mean()

혈액형
A     168.828571
AB    176.500000
B     183.000000
O     181.300000
Name: 키, dtype: float64

In [132]:
# 리스트업 해주면 데이터 프레임 씌워줌
df.groupby('혈액형')[['키']].mean()

              키
혈액형
A    168.828571
AB   176.500000
B    183.000000
O    181.300000

## 5. Multi-Index(복합 인덱스)

In [137]:
# 행 인덱스를 복합적으로 구성하고 싶은 경우는 인덱스를 리스트로 만들어줌
# 이중 groupby
df.groupby(['혈액형', '성별'])[["키", "인기지수"]].mean()

                 키        인기지수
혈액형 성별
A   남자  174.675000  7510457.25
    여자  161.033333  6211841.25
AB  남자  176.500000  5687577.50
B   남자  183.000000  3506027.00
    여자         NaN  4668615.00
O   남자  177.875000  4439919.75
    여자  195.000000  7235678.00

In [139]:
# Multi-Index 데이터 프레임을 피벗 테이블로 변환
# Multi-Index로 된 데이터프레임을 피벗테이블 형태로 다시 변환해 줄 수 있음

# 그룹 by 수행수 multi index 데이터 프레임 만들고,
df2 = df.groupby(['혈액형', '성별'])[["키", "인기지수"]].mean()
df2

                 키        인기지수
혈액형 성별
A   남자  174.675000  7510457.25
    여자  161.033333  6211841.25
AB  남자  176.500000  5687577.50
B   남자  183.000000  3506027.00
    여자         NaN  4668615.00
O   남자  177.875000  4439919.75
    여자  195.000000  7235678.00

In [141]:
# 혈액형 컬럼을 기준으로 피벗테이블 변형
df2.unstack('혈액형')

              키                               인기지수
혈액형           A     AB      B        O           A         AB          B
성별
남자   174.675000  176.5  183.0  177.875  7510457.25  5687577.5  3506027.0  \
여자   161.033333    NaN    NaN  195.000  6211841.25        NaN  4668615.0


혈액형           O
성별
남자   4439919.75
여자   7235678.00

In [144]:
# 성별 기준으로 피벗테이블 변형
df2.unstack('성별')

           키                    인기지수
성별        남자          여자          남자          여자
혈액형
A    174.675  161.033333  7510457.25  6211841.25
AB   176.500         NaN  5687577.50         NaN
B    183.000         NaN  3506027.00  4668615.00
O    177.875  195.000000  4439919.75  7235678.00

In [148]:
# stack
df2.stack()

혈액형  성별
A    남자  키       1.746750e+02
         인기지수    7.510457e+06
     여자  키       1.610333e+02
         인기지수    6.211841e+06
AB   남자  키       1.765000e+02
         인기지수    5.687578e+06
B    남자  키       1.830000e+02
         인기지수    3.506027e+06
     여자  인기지수    4.668615e+06
O    남자  키       1.778750e+02
         인기지수    4.439920e+06
     여자  키       1.950000e+02
         인기지수    7.235678e+06
dtype: float64

In [150]:
# 인덱스 초기화 (reset_index)
# reset_index() 는 Multi-Index로 구성된 데이터 프레임의 인덱스를 초기화해줌

In [152]:
# groupby 하면 그 키값이 인덱스가 되어버림
df2

                 키        인기지수
혈액형 성별
A   남자  174.675000  7510457.25
    여자  161.033333  6211841.25
AB  남자  176.500000  5687577.50
B   남자  183.000000  3506027.00
    여자         NaN  4668615.00
O   남자  177.875000  4439919.75
    여자  195.000000  7235678.00

In [153]:
# axis = 0, 행 index
df2 = df2.reset_index()

In [155]:
df2

  혈액형  성별           키        인기지수
0   A  남자  174.675000  7510457.25
1   A  여자  161.033333  6211841.25
2  AB  남자  176.500000  5687577.50
3   B  남자  183.000000  3506027.00
4   B  여자         NaN  4668615.00
5   O  남자  177.875000  4439919.75
6   O  여자  195.000000  7235678.00

In [156]:
df2.head()

  혈액형  성별           키        인기지수
0   A  남자  174.675000  7510457.25
1   A  여자  161.033333  6211841.25
2  AB  남자  176.500000  5687577.50
3   B  남자  183.000000  3506027.00
4   B  여자         NaN  4668615.00

In [ ]:
# index가 생겨서 삭제해야 할 경우
# column 삭제시 axis=1, default는 axis=0
# df2.drop(['index']) 는 오류 남
# df2.drop(['index'], axis=1)
df1 = df2.drop(['index'], axis=1)
df1

## 6. 피벗테이블(pivot_table)
- 피벗테이블은 엑셀의 피벗테이블과 동일함
- 데이터 열 중에서 두 개의 열을 각각 행 인덱스, 열 인덱스로 사용하여 데이터를 조회하여 펼쳐놓은 것을 의미함
- 왼쪽에 나타나는 인덱스를 행 인덱스, 상단에 나타나는 인덱스를 열 인덱스라고 부름

In [158]:
df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수     국적
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324   대한민국
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027  korea
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501   대한민국
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792   대한민국
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615   대한민국

In [159]:
# index는 행 인덱스
# columns는 열 인덱스
# values는 조회하고 싶은 값
pd.pivot_table(df, index='소속사', columns='혈액형', values='키')

혈액형          A     AB      B       O
소속사
RBW      162.1    NaN    NaN     NaN
SM       160.5    NaN    NaN     NaN
빅히트      175.8  178.0    NaN  176.60
스타크루이엔티  167.1    NaN    NaN     NaN
안테나        NaN    NaN    NaN  195.00
커넥트      180.0    NaN    NaN     NaN
판타지오       NaN    NaN  183.0     NaN
플레디스       NaN  175.0    NaN  179.15

In [162]:
# aggfunc에는 추가 계산 옵션 (np.sum, np.mean) - 기본값은 평균
import numpy as np
pd.pivot_table(df, index='그룹', columns='혈액형', values='인기지수', aggfunc=np.mean)

혈액형            A         AB          B          O
그룹
뉴이스트         NaN  3301654.0        NaN  3274137.0
레드벨벳   6638888.0        NaN        NaN        NaN
마마무    7650928.0        NaN        NaN        NaN
바니그룹         NaN        NaN        NaN  7235678.0
방탄소년단  8865797.5  8073501.0        NaN  4747875.0
소녀시대   3918661.0        NaN        NaN        NaN
아스트로         NaN        NaN  3506027.0        NaN
아이들          NaN        NaN  4668615.0        NaN
핫샷     4036489.0        NaN        NaN        NaN

In [164]:
pd.pivot_table(df, index='그룹', columns='혈액형', values='키', aggfunc=np.mean)

혈액형        A     AB      B      O
그룹
뉴이스트     NaN  175.0    NaN  176.0
레드벨벳   160.5    NaN    NaN    NaN
마마무    162.1    NaN    NaN    NaN
바니그룹     NaN    NaN    NaN  195.0
방탄소년단  175.8  178.0    NaN  176.6
아스트로     NaN    NaN  183.0    NaN
핫샷     167.1    NaN    NaN    NaN